backend/app/controllers/application_controller.rb

  def current_user
    header = request.headers['Authorization']
    token = header.split(' ').last if header
    User.find_by(auth_token: token) if token
---
SELECT "users".* FROM "users" WHERE "users"."auth_token" = 'f21f1386dfa769bceb243dbed09438196e5450ef' LIMIT 1