backend/app/controllers/api/v1/auth_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "auth_token", "created_at", "updated_at") VALUES ('filipinho tricolor', 'tri@santa.com', '$2a$12$ELau4K0BWLxlQfYeKrHDe.RvTL2QDS3QKYE4mZYY2gY1Kf.wD2tqC', '184007a635988766a617353be6f2d7c7a64ba223', '2026-05-09 21:19:08.375794', '2026-05-09 21:19:08.375794') RETURNING "id"
---
      def register
        user = User.new( name: params[:name], email: params[:email], password: params[:password] )

        if user.save

SELECT "users".* FROM "users" WHERE "users"."email" = 'tri@santa.com' LIMIT 1
---
      def login
        user = User.find_by(email: params[:email])