backend/app/controllers/api/v1/courses_controller.rb

SELECT "courses".* FROM "courses"
---
  def index
    courses = params[:mine] == "true" ? current_user.created_courses : Course.all

INSERT INTO "courses" ("name", "description", "start_date", "end_date", "creator_id", "created_at", "updated_at") VALUES ('curso A', 'fazer o curso A', '2026-05-09', '2026-05-09', 4, '2026-05-09 21:26:17.493692', '2026-05-09 21:26:17.493692') RETURNING "id"
---
  def create
    course = current_user.created_courses.new(course_params)