backend/app/controllers/api/v1/lessons_controller.rb

SELECT "lessons".* FROM "lessons" WHERE "lessons"."course_id" = 6 AND "lessons"."status" = 'draft'
---
  def index
    lessons = params[:status].present? ? @course.lessons.where(status: params[:status]) : @course.lessons

INSERT INTO "lessons" ("title", "video_url", "status", "course_id", "created_at", "updated_at") VALUES ('title', 'http://youtube.com/videozinho', 'draft', 7, '2026-05-09 22:02:10.230376', '2026-05-09 22:02:10.230376') RETURNING "id"
---
  def create

    if @course.creator != current_user
      render json: { error: "Forbidden" }, status: :forbidden
      return
    end

    lesson = @course.lessons.new(lesson_params)

    if lesson.save

SELECT "courses".* FROM "courses" WHERE "courses"."id" = 8 LIMIT 1
---
  def set_course
    @course = Course.find(params[:course_id])

SELECT "lessons".* FROM "lessons" WHERE "lessons"."course_id" = 4 AND "lessons"."id" = 8 LIMIT 1
---
  def set_lesson
    @lesson = @course.lessons.find(params[:id])